# HMLR Price Paid Project (SQL)

## Methodology

In this file, we will merge the price paid txt files for each year into one large dataset, then proceed to clean and structure the data into FACT and DIM tables. 

This must be done in order for the data to be loaded into the SQL database storage in an optimised state, following a star schema design to support querying and analysis.

## Import Libraries

Before beginning anything, we must ensure we have the correct libraries and modules imported.

In [179]:
# Importing Libraries
import pandas as pd
import matplotlib.pyplot as plt
from matplotlib.ticker import PercentFormatter
import seaborn as sns
from datasets import load_dataset
import glob

## Load and Merge .txt Files (Price Paid Data from 2018 to 2024)

In [180]:
# Find all .txt files in a folder
file_list = glob.glob(r"C:\Users\Vikram Kapoor\OneDrive\CURRENT LAPTOP\Independent Study\Coding\SQL\HMLR_Price_Paid_Project_SQL\1. origin_txt_files/*.txt")

# Reads all .txt files and concatenates them into a single Pandas dataframe
df_list = [pd.read_csv(file, delimiter =',') for file in file_list]
combined_df = pd.concat(df_list, ignore_index = True)

## Data Cleaning

### Step 1: Understanding the Dataset

This must be done to get an overall understanding of the dataset e.g.missing values, duplicates, anomalies, how many columns there are, what the columns are called and so on.

In [181]:
# Obtains first 10 rows of dataset
combined_df.head(10)

,transaction_unique_identifier,price,date_of_transfer,postcode,property_type,old_or_new,duration,paon,saon,street,locality,town_city,distrct,county,pdd_category_type,record_status
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,2018-06-20 00:00,DL13 4BA,T,N,F,21,NaN,HIGHFIELDS,TOW LAW,BISHOP AUCKLAND,COUNTY DURHAM,COUNTY DURHAM,A,A
1,{726BF13A-993F-0A46-E053-6C04A8C01D0D},115000,2018-07-13 00:00,DL17 9LB,S,N,F,4,NaN,THE LANE,WEST CORNFORTH,FERRYHILL,COUNTY DURHAM,COUNTY DURHAM,A,A
2,{726BF13A-9940-0A46-E053-6C04A8C01D0D},24000,2018-04-10 00:00,SR7 9AG,F,N,L,20B,NaN,WOODS TERRACE,MURTON,SEAHAM,COUNTY DURHAM,COUNTY DURHAM,A,A
3,{726BF13A-9941-0A46-E053-6C04A8C01D0D},56000,2018-06-22 00:00,DL5 5PS,T,N,F,6,NaN,HEILD CLOSE,NaN,NEWTON AYCLIFFE,COUNTY DURHAM,COUNTY DURHAM,A,A
4,{726BF13A-9942-0A46-E053-6C04A8C01D0D},220000,2018-05-25 00:00,DL16 7HE,D,N,F,25,NaN,BECKWITH CLOSE,KIRK MERRINGTON,SPENNYMOOR,COUNTY DURHAM,COUNTY DURHAM,A,A
5,{726BF13A-9943-0A46-E053-6C04A8C01D0D},58000,2018-05-09 00:00,DL14 6FH,F,N,L,23,NaN,AINTREE DRIVE,NaN,BISHOP AUCKLAND,COUNTY DURHAM,COUNTY DURHAM,A,A
6,{726BF13A-9944-0A46-E053-6C04A8C01D0D},115000,2018-06-21 00:00,DH8 7SG,D,N,F,4,NaN,EDEN VALE MEWS,LEADGATE,CONSETT,COUNTY DURHAM,COUNTY DURHAM,A,A
7,{726BF13A-9945-0A46-E053-6C04A8C01D0D},82000,2018-06-01 00:00,DH8 8AB,S,N,F,24,NaN,ARKLESS GROVE,THE GROVE,CONSETT,COUNTY DURHAM,COUNTY DURHAM,A,A
8,{726BF13A-9946-0A46-E053-6C04A8C01D0D},93000,2018-07-06 00:00,DH6 5EJ,S,N,F,14,NaN,HORTON CRESCENT,BOWBURN,DURHAM,COUNTY DURHAM,COUNTY DURHAM,A,A
9,{726BF13A-9947-0A46-E053-6C04A8C01D0D},42500,2018-06-27 00:00,DH9 7TP,T,N,F,18,NaN,CATHERINE TERRACE,ANNFIELD PLAIN,STANLEY,COUNTY DURHAM,COUNTY DURHAM,A,A

In [182]:
# Gives overall view of what values can be expected in each column
combined_df.info

<bound method DataFrame.info of                   transaction_unique_identifier   price  date_of_transfer  \
0        {726BF13A-993E-0A46-E053-6C04A8C01D0D}   75000  2018-06-20 00:00
1        {726BF13A-993F-0A46-E053-6C04A8C01D0D}  115000  2018-07-13 00:00
2        {726BF13A-9940-0A46-E053-6C04A8C01D0D}   24000  2018-04-10 00:00
3        {726BF13A-9941-0A46-E053-6C04A8C01D0D}   56000  2018-06-22 00:00
4        {726BF13A-9942-0A46-E053-6C04A8C01D0D}  220000  2018-05-25 00:00
...                                         ...     ...               ...
6785055  {1EAE3DF6-F7A7-9EB1-E063-4704A8C09D02}  505000  2024-04-19 00:00
6785056  {1EAE3DF6-F7A8-9EB1-E063-4704A8C09D02}  260000  2024-03-21 00:00
6785057  {1EAE3DF6-F7A9-9EB1-E063-4704A8C09D02}  240000  2024-07-18 00:00
6785058  {1EAE3DF6-F7AA-9EB1-E063-4704A8C09D02}  246000  2024-03-18 00:00
6785059  {1EAE3DF6-F7AB-9EB1-E063-4704A8C09D02}  228000  2024-05-30 00:00

         postcode  property_type  old_or_new  duration  paon  saon  \
0        DL13 4BA              T           N         F    21   NaN
1        DL17 9LB              S           N         F     4   NaN
2         SR7 9AG              F           N         L   20B   NaN
3         DL5 5PS              T           N         F     6   NaN
4        DL16 7HE              D           N         F    25   NaN
...           ...            ...         ...       ...   ...   ...
6785055   SY4 4FF              D           N         F    32   NaN
6785056   SY4 1DR              D           N         F    15   NaN
6785057   SY3 5FX              F           N         L    27   NaN
6785058   SY2 6FH              T           N         F   121   NaN
6785059   SY5 0FB              S           N         F    84   NaN

                  street         locality        town_city        distrct  \
0             HIGHFIELDS          TOW LAW  BISHOP AUCKLAND  COUNTY DURHAM
1               THE LANE   WEST CORNFORTH        FERRYHILL  COUNTY DURHAM
2          WOODS TERRACE           MURTON           SEAHAM  COUNTY DURHAM
3            HEILD CLOSE              NaN  NEWTON AYCLIFFE  COUNTY DURHAM
4         BECKWITH CLOSE  KIRK MERRINGTON       SPENNYMOOR  COUNTY DURHAM
...                  ...              ...              ...            ...
6785055      ABBOT DRIVE          HADNALL       SHREWSBURY     SHROPSHIRE
6785056    SANDHURST WAY       NESSCLIFFE       SHREWSBURY     SHROPSHIRE
6785057      OLIVER ROAD     BICTON HEATH       SHREWSBURY     SHROPSHIRE
6785058  GARDENERS PLACE              NaN       SHREWSBURY     SHROPSHIRE
6785059    ORCHID MEADOW       MINSTERLEY       SHREWSBURY     SHROPSHIRE

                county  pdd_category_type  record_status
0        COUNTY DURHAM                  A              A
1        COUNTY DURHAM                  A              A
2        COUNTY DURHAM                  A              A
3        COUNTY DURHAM                  A              A
4        COUNTY DURHAM                  A              A
...                ...                ...            ...
6785055     SHROPSHIRE                  A              A
6785056     SHROPSHIRE                  A              A
6785057     SHROPSHIRE                  A              A
6785058     SHROPSHIRE                  A              A
6785059     SHROPSHIRE                  A              A

[6785060 rows x 16 columns]>

In [183]:
# Gives no. of rows and columns
combined_df.shape

(6785060, 16)

In [184]:
# Provides all column names
combined_df.columns

Index(['transaction_unique_identifier', ' price', ' date_of_transfer',
       ' postcode', ' property_type', ' old_or_new', ' duration', ' paon',
       ' saon', ' street', ' locality', ' town_city', ' distrct', ' county',
       ' pdd_category_type', ' record_status'],
      dtype='object')

### Step 2: Handling Missing Data

Locate missing or null values (blanks or NaNs). These values can be handled in the following ways:
- Impute: Replace with mean, median, mode or predicted value (for numerical data)
- Remove: Delete the roe if too much data is missing or Null
- Leave Empty: Might be proper to leave alone

In [185]:
# Identifies no. of NANs in each column
combined_df.isna().sum()

transaction_unique_identifier          0
 price                                 0
 date_of_transfer                      0
 postcode                          23603
 property_type                         0
 old_or_new                            0
 duration                              0
 paon                                  0
 saon                            5888860
 street                           123782
 locality                        4194946
 town_city                             0
 distrct                               0
 county                                0
 pdd_category_type                     0
 record_status                         0
dtype: int64

In [186]:
# Identifies no. of Blanks in each column
(combined_df == '').sum()

transaction_unique_identifier    0
 price                           0
 date_of_transfer                0
 postcode                        0
 property_type                   0
 old_or_new                      0
 duration                        0
 paon                            0
 saon                            0
 street                          0
 locality                        0
 town_city                       0
 distrct                         0
 county                          0
 pdd_category_type               0
 record_status                   0
dtype: int64

We've ascertained that whilst there are NaNs present in the columns postcode, saon, street and locality, there are no blanks in the dataset.

I've decided to convert the NaNs to blanks in the columns saon, street and locality because they would be impossible to determine without further information. Whilst i considered using some APIs to estimate the postcode data using the data present for street, town_city and district, it wouldn't be necessary for our purposes as we can just use the fully present town_city, district and county data for heatmaps and such that use location, rather than rely on estimated postcodes that could potentially be inaccurate.

In [187]:
# Fill all NaNs in dataset with blanks
combined_df.fillna('', inplace = True)

In [188]:
# Confirms no. of Blanks in each column
(combined_df == '').sum()

transaction_unique_identifier          0
 price                                 0
 date_of_transfer                      0
 postcode                          23603
 property_type                         0
 old_or_new                            0
 duration                              0
 paon                                  0
 saon                            5888860
 street                           123782
 locality                        4194946
 town_city                             0
 distrct                               0
 county                                0
 pdd_category_type                     0
 record_status                         0
dtype: int64

As you can see, the number of blanks equals the number of NaNs there were before in each column they were present.

### Step 3a: Fix Structural Errors (Data Entry Errors)

Correct data entry errors e.g. typos, inconsistent naming convention, formatting etc.

We'll begin first with correcting column names:

In [189]:
# This piece of code strips unnoticed spaces in the column names
# NOTE: I was being prevented from running basic filters on columns because the column name was 'postcode ' instead of 'postcode'
combined_df.columns = combined_df.columns.str.strip()

In [190]:
# Correct incorrect column name from 'distrct' -> 'district'
combined_df.rename(columns = {'distrct': 'district'}, inplace  = True)

In [191]:
# Rename column name for ease from 'transaction_unique_identifier' -> 'transaction_id'
combined_df.rename(columns = {'transaction_unique_identifier': 'transaction_id'}, inplace  = True)

In [192]:
# Confirm renamed columns
combined_df.columns.to_list()

['transaction_id',
 'price',
 'date_of_transfer',
 'postcode',
 'property_type',
 'old_or_new',
 'duration',
 'paon',
 'saon',
 'street',
 'locality',
 'town_city',
 'district',
 'county',
 'pdd_category_type',
 'record_status']

Now we can see whether the data in each column is correct:

In [193]:
# List of possible values for property_type is correct
combined_df['property_type'].unique().tolist()

['T', 'S', 'F', 'D', 'O']

In [194]:
# List of possible values for old_or_new is correct
combined_df['old_or_new'].unique().tolist()

['N', 'Y']

In [195]:
# List of possible values for duration is correct
combined_df['duration'].unique().tolist()

['F', 'L']

In [196]:
# Obtains the count for each unique value in the town_city column
combined_df['town_city'].value_counts().tail(20)

town_city
GARNDOLBENMAEN    77
LYNMOUTH          68
MONTACUTE         65
LLANDINAM         65
LYDBURY NORTH     52
LLANFECHAIN       51
GLOGUE            44
ARTHOG            35
RAVENGLASS        29
MARIANGLAS        25
LLANBEDRGOCH      24
RHOSGOCH          22
NEWCASTLETON      16
DULAS             15
MINDRUM           15
GRETNA             8
GATWICK            7
LLANSANFFRAID      2
KELSO              1
PORT DINORWIC      1
Name: count, dtype: int64

In [197]:
# Obtains the count for each unique value in the district column
combined_df['district'].value_counts().tail(20)

district
CORBY                    4105
WELLINGBOROUGH           3834
POOLE                    3571
SHEPWAY                  3252
CHILTERN                 3143
TAUNTON DEANE            2840
SUFFOLK COASTAL          2737
WAVENEY                  2612
WEST DORSET              2447
SOUTH BUCKS              2179
CITY OF LONDON           2126
ST EDMUNDSBURY           2048
EAST DORSET              1860
WEYMOUTH AND PORTLAND    1643
NORTH DORSET             1511
FOREST HEATH             1508
CHRISTCHURCH             1220
PURBECK                  1009
WEST SOMERSET             818
ISLES OF SCILLY           175
Name: count, dtype: int64

In [198]:
# Obtains the count for each unique value in the county column
combined_df['county'].value_counts().tail(20)

county
NEATH PORT TALBOT          14819
POWYS                      14548
GWYNEDD                    14496
WREXHAM                    12980
HALTON                     12822
HARTLEPOOL                 12538
DENBIGHSHIRE               11646
MONMOUTHSHIRE              10917
SLOUGH                     10339
CUMBERLAND                  9875
TORFAEN                     9743
WESTMORLAND AND FURNESS     8506
ISLE OF ANGLESEY            8305
CEREDIGION                  8145
BLAENAU GWENT               7281
MERTHYR TYDFIL              5645
RUTLAND                     4992
BOURNEMOUTH                 4562
POOLE                       3571
ISLES OF SCILLY              175
Name: count, dtype: int64

After running .value_counts() on the data and obtaining the lowest 20 counts for town_city, district and county, it is clear that there are no obvious spelling errors in the data. Spelling errors like 'Pooefle' for example would usually only occur once, thus we would be able to instantly see with this method. I crosschecked the 1s and they are all legitimate places.

### Step 3b: Fix Structural Errors (Correct Data Types)

Ensure data types are correct e.g. convert numeric data stored as text into numbers, and convert dates from text into the datetime format

In [199]:
# Identifies the datatypes for each column
combined_df.dtypes

transaction_id       object
price                 int64
date_of_transfer     object
postcode             object
property_type        object
old_or_new           object
duration             object
paon                 object
saon                 object
street               object
locality             object
town_city            object
district             object
county               object
pdd_category_type    object
record_status        object
dtype: object

As we can see, most are objects, which in python means they are strings. The only one that must be changed is date of transfer.

In [200]:
# Converts column to datetime format
combined_df['date_of_transfer'] = pd.to_datetime(combined_df['date_of_transfer'])

In [201]:
# Checks its been converted
combined_df.dtypes

transaction_id               object
price                         int64
date_of_transfer     datetime64[ns]
postcode                     object
property_type                object
old_or_new                   object
duration                     object
paon                         object
saon                         object
street                       object
locality                     object
town_city                    object
district                     object
county                       object
pdd_category_type            object
record_status                object
dtype: object

### Step 4 - Check for Duplicate Rows

In [202]:
# Obtains the count for each unique value in the district column
combined_df['transaction_id'].value_counts().head(20)

transaction_id
{726BF13A-993E-0A46-E053-6C04A8C01D0D}    1
{E7B085FC-5C7F-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C89-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C88-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C87-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C86-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C85-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C84-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C83-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C82-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C81-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C80-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C7E-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C8B-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C7D-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C7C-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C7B-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C79-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C78-7E31-E053-6C04A8C0E67F}    1
{E7B085FC-5C77-7E31-E053-6C04A8C0E67F}    1
Name: count, dtype: int64

As you can see above, after obtaining the count of each unique value in transaction_id, there is not value higher than one, which means each transaction_id is unique, therefore, each row is unique.

### Part 5: Final Filters / Adjustments to Columns

Before concluding the cleaning, the final adjustments must be made to the dataset to take into account what we have planned for our SQL queries. With regard to the column ppd_category_type, we are only interested in the standard price paid (A), not the additional prices (B), thus we can filter the entire dataset so only those rows with A associated in that column are included in the dataset we will work with. Then we can delete ppd_category_type along with record_status.

In [203]:
# Obtain list of possible values for pdd_category_type to ensure column is correctly inputted
combined_df['pdd_category_type'].unique().tolist()

['A', 'B']

In [204]:
# Filters for rows regarding standard price paid entries only
df_price_paid = combined_df[combined_df['pdd_category_type'] == 'A']

In [205]:
# Shows number of rows dropped with filter
len(combined_df), len(df_price_paid)

(6785060, 5710657)

In [206]:
# Drop ppd_category_type and record_status
df_price_paid = df_price_paid.drop(columns = ['pdd_category_type', 'record_status'])

In [207]:
# Check column names after drop
df_price_paid.columns.to_list()

['transaction_id',
 'price',
 'date_of_transfer',
 'postcode',
 'property_type',
 'old_or_new',
 'duration',
 'paon',
 'saon',
 'street',
 'locality',
 'town_city',
 'district',
 'county']

## Dimensional Data Modelling

In this section, we will structure the cleaned and edited dataset into FACT and DIM tables.

### DIM_date

This table allows time-based analysis such as yearly trends and seasonal patterns:

In [208]:
# Find out the earliest and latest dates in the dataset
df_price_paid['date_of_transfer'].min(), df_price_paid['date_of_transfer'].max()

(Timestamp('2018-01-01 00:00:00'), Timestamp('2024-12-31 00:00:00'))

In [209]:
# Define earliest and latest dates in dataset
start_date = df_price_paid['date_of_transfer'].min()
end_date = df_price_paid['date_of_transfer'].max()

# Generate dates from earliest date and latest date
date_range = pd.date_range(start = start_date, end = end_date)

# Convert to dataframe
DIM_date = pd.DataFrame(date_range, columns = ['date_of_transfer'])

# Convert date_of_transfer to datetime datatype
DIM_date['date_of_transfer'] = pd.to_datetime(DIM_date['date_of_transfer'])

# Confirm dataframe
DIM_date.head(5)

  date_of_transfer
0       2018-01-01
1       2018-01-02
2       2018-01-03
3       2018-01-04
4       2018-01-05

In [210]:
# Convert date_of_transfer to datetime datatype
DIM_date['date_of_transfer'] = pd.to_datetime(DIM_date['date_of_transfer'])

# Confirm datatype
DIM_date.dtypes

date_of_transfer    datetime64[ns]
dtype: object

In [211]:
# Generate year column in format 'YYYY' and set datatype
DIM_date['year'] = DIM_date['date_of_transfer'].dt.strftime('%Y').astype(int)

# Generate month column in format of full month name e.g. 'January' and set datatype
DIM_date['month'] = DIM_date['date_of_transfer'].dt.strftime('%B').astype(str)

# Generate month column in format of full month name e.g. 'January' and set datatype
DIM_date['quarter'] = 'Q' + DIM_date['date_of_transfer'].dt.quarter.astype(str)

# Confirm new columns
DIM_date.head(5)

  date_of_transfer  year    month quarter
0       2018-01-01  2018  January      Q1
1       2018-01-02  2018  January      Q1
2       2018-01-03  2018  January      Q1
3       2018-01-04  2018  January      Q1
4       2018-01-05  2018  January      Q1

In [212]:
# Confirm datatypes are correct
DIM_date.dtypes

date_of_transfer    datetime64[ns]
year                         int32
month                       object
quarter                     object
dtype: object

In [213]:
# Gives us an index column 
DIM_date = DIM_date.reset_index()

# View table after resetting index to check
DIM_date.head(5)

   index date_of_transfer  year    month quarter
0      0       2018-01-01  2018  January      Q1
1      1       2018-01-02  2018  January      Q1
2      2       2018-01-03  2018  January      Q1
3      3       2018-01-04  2018  January      Q1
4      4       2018-01-05  2018  January      Q1

In [214]:
# Renames index column to date_of_transfer_id
DIM_date.rename(columns = {'index': 'date_of_transfer_id'}, inplace = True)

In [215]:
# Confirm table is good
DIM_date.head(5)

   date_of_transfer_id date_of_transfer  year    month quarter
0                    0       2018-01-01  2018  January      Q1
1                    1       2018-01-02  2018  January      Q1
2                    2       2018-01-03  2018  January      Q1
3                    3       2018-01-04  2018  January      Q1
4                    4       2018-01-05  2018  January      Q1

### FACT_price_paid (Link to DIM_date)

We will now begin work on the FACT table by linking the FACT and DIM table using a common ID

In [216]:
# Makes a copy of the original dataset
FACT_price_paid = df_price_paid.copy()

# Confirm copy was made
FACT_price_paid.head(1)

,transaction_id,price,date_of_transfer,postcode,property_type,old_or_new,duration,paon,saon,street,locality,town_city,district,county
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,2018-06-20,DL13 4BA,T,N,F,21,,HIGHFIELDS,TOW LAW,BISHOP AUCKLAND,COUNTY DURHAM,COUNTY DURHAM

In [217]:
# Merge the Dataframes
FACT_price_paid = pd.merge(FACT_price_paid, DIM_date, on = 'date_of_transfer', how = 'left')

In [218]:
# Inspect changes
FACT_price_paid.head(1)

,transaction_id,price,date_of_transfer,postcode,property_type,old_or_new,duration,paon,saon,street,locality,town_city,district,county,date_of_transfer_id,year,month,quarter
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,2018-06-20,DL13 4BA,T,N,F,21,,HIGHFIELDS,TOW LAW,BISHOP AUCKLAND,COUNTY DURHAM,COUNTY DURHAM,170,2018,June,Q2

In [219]:
# Drop unnecessary columns for FACT table e.g. year, month, quarter
FACT_price_paid = FACT_price_paid.drop(columns = ['year', 'month', 'quarter'])

In [220]:
# Inspect to see whether date_of_transfer_ID has been correctly mapped into the FACT table
FACT_price_paid.head(1)

,transaction_id,price,date_of_transfer,postcode,property_type,old_or_new,duration,paon,saon,street,locality,town_city,district,county,date_of_transfer_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,2018-06-20,DL13 4BA,T,N,F,21,,HIGHFIELDS,TOW LAW,BISHOP AUCKLAND,COUNTY DURHAM,COUNTY DURHAM,170

In [221]:
# Drop the date_of_transfer column now that its' corresponding ID is in
FACT_price_paid = FACT_price_paid.drop(columns = 'date_of_transfer')

### DIM_location

Stores location based insights for regional analysis:

In [222]:
# Extract only the distinct combinations of the location columns
DIM_location = FACT_price_paid[['postcode', 'paon', 'saon', 'street', 'locality', 'town_city', 'district', 'county']].drop_duplicates()

In [223]:
# Inspect new dim table
DIM_location.head()

,postcode,paon,saon,street,locality,town_city,district,county
0,DL13 4BA,21,,HIGHFIELDS,TOW LAW,BISHOP AUCKLAND,COUNTY DURHAM,COUNTY DURHAM
1,DL17 9LB,4,,THE LANE,WEST CORNFORTH,FERRYHILL,COUNTY DURHAM,COUNTY DURHAM
2,SR7 9AG,20B,,WOODS TERRACE,MURTON,SEAHAM,COUNTY DURHAM,COUNTY DURHAM
3,DL5 5PS,6,,HEILD CLOSE,,NEWTON AYCLIFFE,COUNTY DURHAM,COUNTY DURHAM
4,DL16 7HE,25,,BECKWITH CLOSE,KIRK MERRINGTON,SPENNYMOOR,COUNTY DURHAM,COUNTY DURHAM

In [224]:
# Gives us an index column 
DIM_location = DIM_location.reset_index()

# View table after resetting index to check
DIM_location.head(5)

,index,postcode,paon,saon,street,locality,town_city,district,county
0,0,DL13 4BA,21,,HIGHFIELDS,TOW LAW,BISHOP AUCKLAND,COUNTY DURHAM,COUNTY DURHAM
1,1,DL17 9LB,4,,THE LANE,WEST CORNFORTH,FERRYHILL,COUNTY DURHAM,COUNTY DURHAM
2,2,SR7 9AG,20B,,WOODS TERRACE,MURTON,SEAHAM,COUNTY DURHAM,COUNTY DURHAM
3,3,DL5 5PS,6,,HEILD CLOSE,,NEWTON AYCLIFFE,COUNTY DURHAM,COUNTY DURHAM
4,4,DL16 7HE,25,,BECKWITH CLOSE,KIRK MERRINGTON,SPENNYMOOR,COUNTY DURHAM,COUNTY DURHAM

In [225]:
# Renames index column to date_of_transfer_id
DIM_location.rename(columns = {'index': 'location_id'}, inplace = True)

# View table after renaming index to check
DIM_location.head(5)

,location_id,postcode,paon,saon,street,locality,town_city,district,county
0,0,DL13 4BA,21,,HIGHFIELDS,TOW LAW,BISHOP AUCKLAND,COUNTY DURHAM,COUNTY DURHAM
1,1,DL17 9LB,4,,THE LANE,WEST CORNFORTH,FERRYHILL,COUNTY DURHAM,COUNTY DURHAM
2,2,SR7 9AG,20B,,WOODS TERRACE,MURTON,SEAHAM,COUNTY DURHAM,COUNTY DURHAM
3,3,DL5 5PS,6,,HEILD CLOSE,,NEWTON AYCLIFFE,COUNTY DURHAM,COUNTY DURHAM
4,4,DL16 7HE,25,,BECKWITH CLOSE,KIRK MERRINGTON,SPENNYMOOR,COUNTY DURHAM,COUNTY DURHAM

In [230]:
# Confirm DIM_location data types are fine
DIM_location.dtypes

location_id     int64
postcode       object
paon           object
saon           object
street         object
locality       object
town_city      object
district       object
county         object
dtype: object

### FACT_price_paid (Link to DIM_location)

We will now begin work on the FACT table by linking the FACT and DIM table using a common ID

In [226]:
# Inspect FACT table
FACT_price_paid.head(1)

,transaction_id,price,postcode,property_type,old_or_new,duration,paon,saon,street,locality,town_city,district,county,date_of_transfer_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,DL13 4BA,T,N,F,21,,HIGHFIELDS,TOW LAW,BISHOP AUCKLAND,COUNTY DURHAM,COUNTY DURHAM,170

In [227]:
# Merge the Dataframes
FACT_price_paid = pd.merge(FACT_price_paid, DIM_location, on = ['postcode', 'paon', 'saon', 'street', 'locality', 'town_city', 'district', 'county'], how = 'left')

In [228]:
# Inspect FACT table, check if the IDs map correctly
FACT_price_paid.head(5)

,transaction_id,price,postcode,property_type,old_or_new,duration,paon,saon,street,locality,town_city,district,county,date_of_transfer_id,location_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,DL13 4BA,T,N,F,21,,HIGHFIELDS,TOW LAW,BISHOP AUCKLAND,COUNTY DURHAM,COUNTY DURHAM,170,0
1,{726BF13A-993F-0A46-E053-6C04A8C01D0D},115000,DL17 9LB,S,N,F,4,,THE LANE,WEST CORNFORTH,FERRYHILL,COUNTY DURHAM,COUNTY DURHAM,193,1
2,{726BF13A-9940-0A46-E053-6C04A8C01D0D},24000,SR7 9AG,F,N,L,20B,,WOODS TERRACE,MURTON,SEAHAM,COUNTY DURHAM,COUNTY DURHAM,99,2
3,{726BF13A-9941-0A46-E053-6C04A8C01D0D},56000,DL5 5PS,T,N,F,6,,HEILD CLOSE,,NEWTON AYCLIFFE,COUNTY DURHAM,COUNTY DURHAM,172,3
4,{726BF13A-9942-0A46-E053-6C04A8C01D0D},220000,DL16 7HE,D,N,F,25,,BECKWITH CLOSE,KIRK MERRINGTON,SPENNYMOOR,COUNTY DURHAM,COUNTY DURHAM,144,4

In [231]:
# Drop the location column now that their corresponding ID is in FACT table
FACT_price_paid = FACT_price_paid.drop(columns = ['postcode', 'paon', 'saon', 'street', 'locality', 'town_city', 'district', 'county'])

In [232]:
# Inspect FACT table, confirm columns are correctly dropped
FACT_price_paid.head(1)

,transaction_id,price,property_type,old_or_new,duration,date_of_transfer_id,location_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,T,N,F,170,0

### DIM_property_type

Stores Property Specific details:

In [255]:
# Extract only the distinct combinations of the location columns
DIM_property_type = FACT_price_paid['property_type'].drop_duplicates()

In [256]:
# Inspect new dim table
DIM_property_type.head()

0    T
1    S
2    F
4    D
Name: property_type, dtype: object

In [257]:
# Gives us an index column 
DIM_property_type = DIM_property_type.reset_index()

# Gives us an index column again so no index skip between 2 and 4
DIM_property_type = DIM_property_type.reset_index()

# View table after resetting index to check
DIM_property_type.head(5)

   level_0  index property_type
0        0      0             T
1        1      1             S
2        2      2             F
3        3      4             D

In [ ]:
# Renames index column to property_type_id
DIM_property_type.rename(columns = {'level_0': 'property_type_id'}, inplace = True)

# View table after renaming index to check
DIM_property_type.head(5)

   property_type_id  index property_type
0                 0      0             T
1                 1      1             S
2                 2      2             F
3                 3      4             D

In [259]:
# Adds missing option, though there is no row with other, it' still an option
DIM_property_type.loc[4] = [4, '', 'O']

In [260]:
# View table adding the new row
DIM_property_type.head(5)

   property_type_id index property_type
0                 0     0             T
1                 1     1             S
2                 2     2             F
3                 3     4             D
4                 4                   O

In [261]:
# Drop the index column
DIM_property_type = DIM_property_type.drop(columns = 'index')

# View table to confirm as correct
DIM_property_type.head(5)

   property_type_id property_type
0                 0             T
1                 1             S
2                 2             F
3                 3             D
4                 4             O

### FACT_price_paid (Link to DIM_property_type)

We will now begin work on the FACT table by linking the FACT and DIM table using a common ID

In [262]:
# Inspect FACT table
FACT_price_paid.head(1)

,transaction_id,price,property_type,old_or_new,duration,date_of_transfer_id,location_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,T,N,F,170,0

In [263]:
# Merge the Dataframes
FACT_price_paid = pd.merge(FACT_price_paid, DIM_property_type, on = 'property_type', how = 'left')

In [ ]:
# Inspect FACT table, confirm IDs are mapped correctly
FACT_price_paid.head(5)

,transaction_id,price,property_type,old_or_new,duration,date_of_transfer_id,location_id,property_type_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,T,N,F,170,0,0
1,{726BF13A-993F-0A46-E053-6C04A8C01D0D},115000,S,N,F,193,1,1
2,{726BF13A-9940-0A46-E053-6C04A8C01D0D},24000,F,N,L,99,2,2
3,{726BF13A-9941-0A46-E053-6C04A8C01D0D},56000,T,N,F,172,3,0
4,{726BF13A-9942-0A46-E053-6C04A8C01D0D},220000,D,N,F,144,4,3

In [266]:
# Drop the property_type column now that their corresponding ID is in FACT table
FACT_price_paid = FACT_price_paid.drop(columns = 'property_type')

In [267]:
# Inspect FACT table
FACT_price_paid.head(1)

,transaction_id,price,old_or_new,duration,date_of_transfer_id,location_id,property_type_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,N,F,170,0,0

### DIM_old_or_new

Facilitates comparisons between new and old properties:

In [268]:
# Extract only the distinct combinations of the location columns
DIM_old_or_new = FACT_price_paid['old_or_new'].drop_duplicates()

In [ ]:
# Inspect new dim table
DIM_old_or_new.head()

0      N
118    Y
Name: old_or_new, dtype: object

In [ ]:
# Gives us an index column 
DIM_old_or_new = DIM_old_or_new.reset_index()

# Gives us an index column again so no index skip between 0 and 118
DIM_old_or_new = DIM_old_or_new.reset_index()

# View table after resetting index to check
DIM_old_or_new.head()

   level_0  index old_or_new
0        0      0          N
1        1    118          Y

In [271]:
# Renames level_0 column to old_or_new_id
DIM_old_or_new.rename(columns = {'level_0': 'old_or_new_id'}, inplace = True)

# Drop the index column
DIM_old_or_new = DIM_old_or_new.drop(columns = 'index')

# View table to confirm as correct
DIM_old_or_new.head()

   old_or_new_id old_or_new
0              0          N
1              1          Y

### FACT_price_paid (Link to DIM_old_or_new)

We will now begin work on the FACT table by linking the FACT and DIM table using a common ID

In [272]:
# Inspect FACT table
FACT_price_paid.head(1)

,transaction_id,price,old_or_new,duration,date_of_transfer_id,location_id,property_type_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,N,F,170,0,0

In [273]:
# Merge the Dataframes
FACT_price_paid = pd.merge(FACT_price_paid, DIM_old_or_new, on = 'old_or_new', how = 'left')

In [280]:
# Inspect FACT table, confirm IDs are mapped correctly
FACT_price_paid.head()

,transaction_id,price,duration,date_of_transfer_id,location_id,property_type_id,old_or_new_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,F,170,0,0,0
1,{726BF13A-993F-0A46-E053-6C04A8C01D0D},115000,F,193,1,1,0
2,{726BF13A-9940-0A46-E053-6C04A8C01D0D},24000,L,99,2,2,0
3,{726BF13A-9941-0A46-E053-6C04A8C01D0D},56000,F,172,3,0,0
4,{726BF13A-9942-0A46-E053-6C04A8C01D0D},220000,F,144,4,3,0

In [ ]:
# Drop the old_or_new column now that their corresponding ID is in FACT table
FACT_price_paid = FACT_price_paid.drop(columns = 'old_or_new')

In [279]:
# Inspect FACT table
FACT_price_paid.head(1)

,transaction_id,price,duration,date_of_transfer_id,location_id,property_type_id,old_or_new_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,F,170,0,0,0

### DIM_duration

Allows analysis of Freehold vs. Leasehold pricing differences:

In [281]:
# Extract only the distinct combinations of the location columns
DIM_duration = FACT_price_paid['duration'].drop_duplicates()

In [282]:
# Inspect new dim table
DIM_duration.head()

0    F
2    L
Name: duration, dtype: object

In [283]:
# Gives us an index column 
DIM_duration = DIM_duration.reset_index()

# Gives us an index column again so no index skip between 0 and 2
DIM_duration = DIM_duration.reset_index()

# View table after resetting index to check
DIM_duration.head()

   level_0  index duration
0        0      0        F
1        1      2        L

In [284]:
# Renames level_0 column to duration_id
DIM_duration.rename(columns = {'level_0': 'duration_id'}, inplace = True)

# Drop the index column
DIM_duration = DIM_duration.drop(columns = 'index')

# View table to confirm as correct
DIM_duration.head()

   duration_id duration
0            0        F
1            1        L

### FACT_price_paid (Link to DIM_duration)

We will now begin work on the FACT table by linking the FACT and DIM table using a common ID

In [285]:
# Inspect FACT table
FACT_price_paid.head(1)

,transaction_id,price,duration,date_of_transfer_id,location_id,property_type_id,old_or_new_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,F,170,0,0,0

In [286]:
# Merge the Dataframes
FACT_price_paid = pd.merge(FACT_price_paid, DIM_duration, on = 'duration', how = 'left')

In [287]:
# Inspect FACT table, confirm IDs are mapped correctly
FACT_price_paid.head()

,transaction_id,price,duration,date_of_transfer_id,location_id,property_type_id,old_or_new_id,duration_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,F,170,0,0,0,0
1,{726BF13A-993F-0A46-E053-6C04A8C01D0D},115000,F,193,1,1,0,0
2,{726BF13A-9940-0A46-E053-6C04A8C01D0D},24000,L,99,2,2,0,1
3,{726BF13A-9941-0A46-E053-6C04A8C01D0D},56000,F,172,3,0,0,0
4,{726BF13A-9942-0A46-E053-6C04A8C01D0D},220000,F,144,4,3,0,0

In [ ]:
# Drop the duration column now that their corresponding ID is in FACT table
FACT_price_paid = FACT_price_paid.drop(columns = 'duration')

In [289]:
# Inspect FACT table
FACT_price_paid.head(1)

,transaction_id,price,date_of_transfer_id,location_id,property_type_id,old_or_new_id,duration_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,170,0,0,0,0

## Final Inspection

Ensure columns and datatypes are correct.

### FACT_price_paid

In [ ]:
# Inspect FACT table
FACT_price_paid

,transaction_id,price,date_of_transfer_id,location_id,property_type_id,old_or_new_id,duration_id
0,{726BF13A-993E-0A46-E053-6C04A8C01D0D},75000,170,0,0,0,0
1,{726BF13A-993F-0A46-E053-6C04A8C01D0D},115000,193,1,1,0,0
2,{726BF13A-9940-0A46-E053-6C04A8C01D0D},24000,99,2,2,0,1
3,{726BF13A-9941-0A46-E053-6C04A8C01D0D},56000,172,3,0,0,0
4,{726BF13A-9942-0A46-E053-6C04A8C01D0D},220000,144,4,3,0,0
...,...,...,...,...,...,...,...
5710652,{1EAE3DF6-F7A7-9EB1-E063-4704A8C09D02},505000,2300,1332756,3,0,0
5710653,{1EAE3DF6-F7A8-9EB1-E063-4704A8C09D02},260000,2271,101607,3,0,0
5710654,{1EAE3DF6-F7A9-9EB1-E063-4704A8C09D02},240000,2390,921647,2,0,1
5710655,{1EAE3DF6-F7AA-9EB1-E063-4704A8C09D02},246000,2268,1150349,0,0,0
5710656,{1EAE3DF6-F7AB-9EB1-E063-4704A8C09D02},228000,2341,1152302,1,0,0

In [291]:
# Inspect FACT table datatypes
FACT_price_paid.dtypes

transaction_id         object
price                   int64
date_of_transfer_id     int64
location_id             int64
property_type_id        int64
old_or_new_id           int64
duration_id             int64
dtype: object

### DIM_date

In [292]:
# Inspect DIM table
DIM_date

      date_of_transfer_id date_of_transfer  year     month quarter
0                       0       2018-01-01  2018   January      Q1
1                       1       2018-01-02  2018   January      Q1
2                       2       2018-01-03  2018   January      Q1
3                       3       2018-01-04  2018   January      Q1
4                       4       2018-01-05  2018   January      Q1
...                   ...              ...   ...       ...     ...
2552                 2552       2024-12-27  2024  December      Q4
2553                 2553       2024-12-28  2024  December      Q4
2554                 2554       2024-12-29  2024  December      Q4
2555                 2555       2024-12-30  2024  December      Q4
2556                 2556       2024-12-31  2024  December      Q4

[2557 rows x 5 columns]

In [293]:
# Inspect DIM table datatypes
DIM_date.dtypes

date_of_transfer_id             int64
date_of_transfer       datetime64[ns]
year                            int32
month                          object
quarter                        object
dtype: object

### DIM_location

In [294]:
# Inspect DIM table
DIM_location

,location_id,postcode,paon,saon,street,locality,town_city,district,county
0,0,DL13 4BA,21,,HIGHFIELDS,TOW LAW,BISHOP AUCKLAND,COUNTY DURHAM,COUNTY DURHAM
1,1,DL17 9LB,4,,THE LANE,WEST CORNFORTH,FERRYHILL,COUNTY DURHAM,COUNTY DURHAM
2,2,SR7 9AG,20B,,WOODS TERRACE,MURTON,SEAHAM,COUNTY DURHAM,COUNTY DURHAM
3,3,DL5 5PS,6,,HEILD CLOSE,,NEWTON AYCLIFFE,COUNTY DURHAM,COUNTY DURHAM
4,4,DL16 7HE,25,,BECKWITH CLOSE,KIRK MERRINGTON,SPENNYMOOR,COUNTY DURHAM,COUNTY DURHAM
...,...,...,...,...,...,...,...,...,...
5185913,5710644,SY13 1XE,7,,THE BEECHES,,WHITCHURCH,SHROPSHIRE,SHROPSHIRE
5185914,5710645,WV16 4BT,37,,KINGS LOADE,,BRIDGNORTH,SHROPSHIRE,SHROPSHIRE
5185915,5710646,TF2 7DS,157,,TRENCH ROAD,TRENCH,TELFORD,WREKIN,WREKIN
5185916,5710649,SY8 1DJ,BETJEMAN LODGE,FLAT 10,CORVE STREET,,LUDLOW,SHROPSHIRE,SHROPSHIRE
5185917,5710650,SY8 1LL,8,,KENNET BANK,,LUDLOW,SHROPSHIRE,SHROPSHIRE

In [295]:
# Inspect DIM table datatypes
DIM_location.dtypes

location_id     int64
postcode       object
paon           object
saon           object
street         object
locality       object
town_city      object
district       object
county         object
dtype: object

### DIM_property_type

In [296]:
# Inspect DIM table
DIM_property_type

   property_type_id property_type
0                 0             T
1                 1             S
2                 2             F
3                 3             D
4                 4             O

In [297]:
# Inspect DIM table datatypes
DIM_property_type.dtypes

property_type_id     int64
property_type       object
dtype: object

### DIM_old_or_new

In [298]:
# Inspect DIM table
DIM_old_or_new

   old_or_new_id old_or_new
0              0          N
1              1          Y

In [299]:
# Inspect DIM table datatypes
DIM_old_or_new.dtypes

old_or_new_id     int64
old_or_new       object
dtype: object

### DIM_duration

In [300]:
# Inspect DIM table
DIM_duration

   duration_id duration
0            0        F
1            1        L

In [301]:
# Inspect DIM table datatypes
DIM_duration.dtypes

duration_id     int64
duration       object
dtype: object

## Final Export

In [302]:
FACT_price_paid.to_csv("FACT_price_paid.csv", index=False)  # Save FACT table
DIM_date.to_csv("DIM_date.csv", index=False)  # Save DIM table
DIM_location.to_csv("DIM_location.csv", index=False)  # Save DIM table
DIM_property_type.to_csv("DIM_property_type.csv", index=False)  # Save DIM table
DIM_old_or_new.to_csv("DIM_old_or_new.csv", index=False)  # Save DIM table
DIM_duration.to_csv("DIM_duration.csv", index=False)  # Save DIM table